plant_lexicon/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    User.find(session[:user_id]) if session[:user_id]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def weather
    if session[:user_id]
      user = User.find(session[:user_id])