plant_lexicon/app/controllers/pages_controller.rb

  def index
    @header = 'Plant Lexicon'
    @plants_all = Plant.all
---
SELECT "plants".* FROM "plants"