plant_lexicon/app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
  def detailed
    @plants = Plant.all