plant_lexicon/app/controllers/plants_controller.rb

  def full
    @plants = Plant.all
---
SELECT "plants".* FROM "plants"

  def detailed
    @plants = Plant.find(params[:id])
    # When the user permission is admin, the user sees an edit button on the detailed plant page
    @permission = Permission.find_by_user_id(session[:user_id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."user_id" = $1 LIMIT $2  [["user_id", "13"], ["LIMIT", 1]]

  def create
    p1 = Plant.new
    p1.classification = params[:classification]
    p1.common_name = params[:common_name]
    p1.scientific_name = params[:scientific_name]
    p1.image_mature = params[:image_mature]
    p1.image_seedpod = params[:image_seedpod]
    p1.origin = params[:origin]
    p1.australian_growing_zone = params[:australian_growing_zone]
    p1.predators = params[:predators]
    p1.palatability = params[:palatability]
    p1.toxicity = params[:toxicity]
    p1.control = params[:control]
    p1.notes = params[:notes]
    p1.external_link = params[:external_link]
    p1.save
---
INSERT INTO "plants" ("classification", "common_name", "scientific_name", "image", "origin", "australian_growing_zone", "predators", "palatability", "toxicity", "control", "notes", "external_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def edit
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    plant = Plant.find(params[:id])
    plant.classification = params[:classification] if params[:classification]
    plant.common_name = params[:common_name] if params[:common_name]
    plant.scientific_name = params[:scientific_name] if params[:scientific_name]
    plant.image_mature = params[:image_mature] if params[:image_mature]
    plant.image_seedpod = params[:image_seedpod] if params[:image_seedpod]
    plant.origin = params[:origin] if params[:origin]
    plant.australian_growing_zone = params[:australian_growing_zone] if params[:australian_growing_zone]
    plant.predators = params[:predators] if params[:predators]
    plant.palatability = params[:palatability] if params[:palatability]
    plant.toxicity = params[:toxicity] if params[:toxicity]
    plant.control = params[:control] if params[:control]
    plant.notes = params[:notes] if params[:notes]
    plant.external_link = params[:external_link] if params[:external_link]
    plant.save
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "plants" SET "common_name" = $1, "scientific_name" = $2, "image_mature" = $3, "image_seedpod" = $4, "origin" = $5, "australian_growing_zone" = $6, "predators" = $7, "palatability" = $8, "toxicity" = $9, "control" = $10, "notes" = $11, "external_link" = $12, "updated_at" = $13 WHERE "plants"."id" = $14