plant_lexicon/app/controllers/users_controller.rb

  def index
    @plants = Plant.all
---
SELECT "plants".* FROM "plants"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("user_name", "email", "postcode", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @u1 = User.find(session[:user_id])
    @u1.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]