plant_lexicon/app/controllers/weather_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def retrieve
    user = User.find(:id)